In [166]:
import pandas as pd

In [167]:
df=pd.read_csv("https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/titanic.csv")
df.head(2)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1

In [168]:
df.drop(['PassengerId','Name','Parch','SibSp','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [169]:

inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [171]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [173]:
dummies=pd.get_dummies(inputs.Sex)
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [177]:
inputs=pd.concat([inputs,dummies],axis='columns')

In [178]:
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [179]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [180]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [181]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [182]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [183]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [184]:
model.fit(X_train,y_train)

GaussianNB()

In [185]:
model.score(X_test,y_test)

0.7873134328358209

In [186]:
X_test[0:10]

     Pclass        Age     Fare  female
430       1  28.000000  26.5500       0
715       3  19.000000   7.6500       0
846       3  29.699118  69.5500       0
644       3   0.750000  19.2583       1
15        2  55.000000  16.0000       1
288       2  42.000000  13.0000       0
878       3  29.699118   7.8958       0
847       3  35.000000   7.8958       0
601       3  29.699118   7.8958       0
624       3  21.000000  16.1000       0

In [187]:
y_test[0:10]

430    1
715    0
846    0
644    1
15     1
288    1
878    0
847    0
601    0
624    0
Name: Survived, dtype: int64

In [188]:
model.predict(X_test[0:10])

array([0, 0, 0, 1, 1, 0, 0, 0, 0, 0], dtype=int64)

In [189]:
model.predict_proba(X_test[:10])

array([[0.76676339, 0.23323661],
       [0.94708741, 0.05291259],
       [0.86030452, 0.13969548],
       [0.15801768, 0.84198232],
       [0.20332742, 0.79667258],
       [0.9254839 , 0.0745161 ],
       [0.95825623, 0.04174377],
       [0.96036353, 0.03963647],
       [0.95825623, 0.04174377],
       [0.9490884 , 0.0509116 ]])